/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   signal_type.h                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: singeonho <singeonho@student.42.fr>        +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/10/23 14:38:32 by singeonho         #+#    #+#             */
/*   Updated: 2023/10/23 17:39:29 by singeonho        ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
ctrl+C (2, SIGINT)
- 실행을 중지하고 프로세스를 종료시킨다.
- 프롬프트를 다시 띄우게 된다.

ctrl+\ (3, SIGQUIT)
- 실행을 중지하고 프로세스를 종료시킨 뒤 코어덤프 발생
- 코어덤프는 프로그램이 비정상적으로 종료되었을 때 작성 중이었던 메모리 상태를 기록한 파일

ctrl+D (15, SIGTERM)
- 프로세스를 정상 종료 시킴
- Standard Input에 EOF를 등록한다. 쉘에 더 이상 명령을 입력하지 않겠다는 뜻
- 프로세스의 할 일을 모두 마치고 터미널을 종료시킨다.
- kill명령의 기본 시그널 
*/

typedef enum e_signal
{
	SIGINT = 2,
	SIGQUIT = 3,
	SIGTERM = 15,
	SIGUSR1 = 30,
	SIGUSR2 = 31
}	t_signal;